Repository: mvpossum/cms-oia
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: es

source: Compilation succeeded
es: Compilación exitosa

source: Your submission successfully compiled to an excutable.
es: Tu envío compiló exitosamente a un ejecutable

source: Compilation failed
es: Compilación fallida

source: Your submission did not compile correctly.
es: Tu envío no compilo correctamente.

source: Compilation timed out
es: La compilación tardó demasiado

source: Your submission exceeded the time limit while compiling. This might be caused by an excessive use of C++ templates, for example.
es: Tu envío excedió el tiempo límite mientras compilaba. Esto puede ser causado por un uso excesivo de templates de C++, por ejemplo.

source: Compilation killed with signal %s (could be triggered by violating memory limits)
es: Compilación matada con señal %s (pudo ser causada por una violación de memoria)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit for the compilation, and in turn by an excessive use of C++ templates, for example.
es: Tu envío fue matado con la señal especificada. Entre otras cosas, esto puede ser causado por excederse el límite de memoria para la compilación, y por el uso excesivo de templates de C++, por ejemplo.

source: Output is correct
es: La salida es correcta

source: Your submission ran and gave the correct answer
es: Tu envío se ejecutó y devolvío la respuesta correcta

source: Output isn't correct
es: La salida es incorrecta

source: Your submission ran, but gave the wrong answer
es: Tu envío se ejecutó, pero devolvió una respuesta incorrecta.

source: Evaluation didn't produce file %s
es: La evaluación no produjo el archivo %s

source: Your submission ran, but did not write on the correct output file
es: Tu envío se ejecutó, pero no escribió nada en el archivo de salida indicado.

source: Execution timed out
es: Límite de tiempo excedido

source: Your submission used too much CPU time.
es: Tu envío usó demasiado tiempo de CPU.

source: Execution timed out (wall clock limit exceeded)
es: La ejecución tardó demasido (wall clock excedido)

source: Your submission used too much total time. This might be triggered by undefined code, or buffer overflow, for example. Note that in this case the CPU time visible in the submission details might be much smaller than the time limit.
es: Tu envío usó demasiado tiempo. Esto puede ser ocasionado por código indefinido, o buffer overflow, por ejemplo. Notar que en este caso el tiempo de CPU mostrado en los detalles del envío pueden ser mucho más pequeños que el límite de tiempo.

source: Execution killed with signal %d (could be triggered by violating memory limits)
es: Compilación matada con señal %d (pudo ser causada por una violación de memoria)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit. Note that if this is the reason, the memory usage visible in the submission details is the usage before the allocation that caused the signal.
es: Tu envío fue matado con la señal especificada. Entre otras cosas, esto puede ser causado por excederse el límite de memoria. Notar que sí esta es la razón, el uso de memoria mostrado en los detalles del envío es el uso anterior a la reservación que causo la señal.

source: Execution killed because of forbidden syscall %s
es: Ejecución matada debido a llamada prohibida al sistema

source: Your submission was killed because it tried to use the forbidden syscall specified in the message.
es: Tu envío fue matado porque intentó usar la syscall prohibida especificada en el mensaje.

source: Execution killed because of forbidden file access
es: Ejecución matada debido a acceso a archivo prohibido

source: Your submission was killed because it tried to read or write a forbidden file.
es: Tu envío fue matado porque intentó leer o escribir un archivo prohibido.

source: Execution failed because the return code was nonzero
es: Ejecución fallida debido a que el código de retorno no fue cero

source: Your submission failed because it exited with a return code different from 0.
es: Tu envío fue matado porque termino con un return code diferente al 0.

source: N/A
es: S/R

source: Subtask %d
es: Subproblema %d

source: Outcome
es: Resultado

source: Details
es: Detalles

source: Execution time
es: Tiempo de ejecución

source: Memory used
es: Memoria usada

source: Not correct
es: Incorrecto

source: Correct
es: Correcto

source: Partially correct
es: Parcialmente correcto

source: Invalid files in submission
es: Archivos inválidos en el envío

source: Execution completed successfully
es: Ejecución completada exitosamente

source: No compilation needed
es: No se necesita compilación

source: File not submitted
es: Archivo no enviado

source: %Y-%m-%d %H:%M:%S
es: %d-%m-%Y %H:%M:%S

source: loading...
es: cargando...

source: %d second
es: %d segundo

source: %d minute
es: %d minuto

source: %d hour
es: %d hora

source: %d day
es: % día

source: %s and %s
es: %s y %s

source: more than %s
es: más de %s

source: contest-token
es: token-competencia

source: contest-tokens
es: tokens-competencia

source: task-token
es: token-problema

source: task-tokens
es: tokens-problema

source: You don't have %(type_pl)s available for this task.
es: No tienes %(type_pl)s disponibles para este problema

source: You have an infinite number of %(type_pl)s for this task.
es: Tienes un número infinito de %(type_pl)s para este problema.

source: You start with no %(type_pl)s.
es: Comienzas sin %(type_pl)s.

source: You start with one %(type_s)s.
es: Comienzas con un %(type_s)s.

source: Every minute
es: Cada minuto

source: you get another %(type_s)s,
es: recibes otro %(type_s)s,

source: up to a maximum of one %(type_s)s.
es: hasta un máximo de un %(type_s)s.

source: you get another %(type_s)s.
es: recibes otro %(type_s)s.

source: You don't get other %(type_pl)s.
es: No recibes otro %(type_pl)s.

source: You can use a %(type_s)s every second
es: Puedes usar %(type_s)s cada segundo

source: and no more than one %(type_s)s in total.
es: y no más de un %(type_s)s en total.

source: You can use a %(type_s)s every second.
es: Puedes usar %(type_s)s cada segundo.

source: You can use no more than one %(type_s)s in total.
es: No puedes usar más de %(type_s)s en total.

source: You have no limitations on how you use them.
es: No tienes limitaciones en cómo usarlos.

source: Question too big!
es: Pregunta demasiado grande!

source: You have reached the question length limit.
es: Has alcanzado el límite en la longitud de la pregunta.

source: Question received
es: Pregunta recibida

source: Your question has been received, you will be notified when it is answered.
es: Tu pregunta fue recibida, serás notificado cuando sea respondida.

source: Too many print jobs!
es: ¡Demasiados pedidos de impresión!

source: You have reached the maximum limit of at most %d print jobs.
es: Has alcanzado el límite máximo de a lo sumo %d pedidos de impresión.

source: Invalid format!
es: Formato inválido!

source: Please select the correct files.
es: Por favor seleccione los archivos correctos.

source: File too big!
es: Prueba demasiado grande!

source: Each file must be at most %d bytes long.
es: Cada código fuente debe pesar a lo sumo %d bytes.

source: Print job storage failed!
es: Error al guardar el pedido de impresión

source: Please try again.
es: Por favor intente de nuevo.

source: Print job received
es: Pedido de impresión recibido

source: Your print job has been received.
es: Tu pedido de impresión fue recibido.

source: You have reached the maximum limit of at most %d submissions among all tasks.
es: Has alcanzado el límite de a lo sumo %d envíos en todos los problemas.

source: You have reached the maximum limit of at most %d submissions on this task.
es: Has alcanzado el límite de a lo sumo %d envíos en este problema.

source: Too many submissions!
es: ¡Demasiados envíos!

source: Among all tasks, you can submit again after %d seconds from last submission.
es: Entre todos los problemas, puedes enviar otra solución después de %d segundos de tu último envío.

source: For this task, you can submit again after %d seconds from last submission.
es: Para este problema, puedes enviar otra solución después de %d segundos de tu último envío.

source: Submissions too frequent!
es: ¡Envíos muy frecuentes!

source: Invalid submission format!
es: ¡Formato de envío inválido!

source: Invalid archive format!
es: ¡Formato de archivo inválido!

source: The submitted archive could not be opened.
es: El archivo enviado no pudo abrirse.

source: Cannot recognize submission's language.
es: No se pudo reconocer el lenguaje del envío.

source: All sources must be in the same language.
es: Todos los códigos fuentes deben estar en el mismo lenguaje.

source: Language %s not allowed in this contest.
es: El lenguaje %s no está permitido en está competencia.

source: Invalid submission!
es: ¡Envío inválido!

source: Submission too big!
es: ¡Envío demasiado grande!

source: Each source file must be at most %d bytes long.
es: Cada código fuente debe pesar a lo sumo %d bytes.

source: Submission storage failed!
es: ¡Fallo al guardar el envío!

source: Submission received
es: Envío recibido

source: Your submission has been received and is currently being evaluated.
es: Tu envío ha sido recibido y está siendo evaluado.

source: Compiling...
es: Compilando...

source: details
es: detalles

source: Evaluating...
es: Evaluando...

source: Scoring...
es: Puntuando...

source: Evaluated
es: Evaluado

source: Token request discarded
es: Pedido de Token descartado

source: Your request has been discarded because you have no tokens available.
es: Tu pedido ha sido descartado porque no te quedan tokens disponibles.

source: Your request has been discarded because you already used a token on that submission.
es: Tu pedido ha sido descartado porque ya usaste un token en ese envío.

source: Token request received
es: Pedido de token recibido

source: Your request has been received and applied to the submission.
es: Tu pedido fue recibido y aplicado al envío.

source: You have reached the maximum limit of at most %d tests among all tasks.
es: Has alcanzado el límite máximo de a lo sumo %d pruebas sobre todos los problemas.

source: You have reached the maximum limit of at most %d tests on this task.
es: Has alcanzado el límite máximo de a lo sumo %d pruebas en este problema.

source: Too many tests!
es: ¡Demasiadas pruebas!

source: Among all tasks, you can test again after %d seconds from last test.
es: Entre todos los problemas, puedes probar de nuevo luego de %d segundos desde la última prueba.

source: For this task, you can test again after %d seconds from last test.
es: Para este problema, puedes probar de nuevo luego de %d segundos desde la última prueba.

source: Tests too frequent!
es: Pruebas muy frecuentes!

source: Invalid test format!
es: Formato de prueba inválido!

source: Cannot recognize test's language.
es: No se puede reconocer el lenguaje de la prueba

source: Invalid test!
es: Prueba inválida!

source: Test too big!
es: Prueba demasiado grande!

source: Input too big!
es: Entrada demasiado grande!

source: The input file must be at most %d bytes long.
es: El archivo de entrada debe pesar como mucho %d bytes

source: Test storage failed!
es: Error al guardar la prueba

source: Test received
es: Prueba recibida

source: Your test has been received and is currently being executed.
es: Tu prueba fue recibida y está siendo ejecutada

source: Executing...
es: Ejecutando...

source: Executed
es: Ejecutada

source: Automatic (%s)
es: Automático (%s)

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>, level <strong>%(lvl)s</strong>
es: Identificado como <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>, nivel <strong>%(lvl)s</strong>

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
es: Identificado como <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>

source: Logout
es: Salir

source: Failed to log in.
es: Error al iniciar sesión

source: Welcome
es: Bienvenido

source: Please log in
es: Por favor inicie sesión

source: Username
es: Usuario

source: Password
es: Contraseña

source: Login
es: Ingresar

source: Reset
es: Reiniciar

source: New message
es: Nuevo mensaje

source: New announcement
es: Nuevo anuncio

source: New answer
es: Nueva respuesta

source: %d unread
es: %d no leídos

source: Until contest starts:
es: Cuenta regresiva:

source: Until contest ends:
es: Tiempo hasta que la competencia termine:

source: Time left:
es: Tiempo restante:

source: Server time:
es: Hora del servidor:

source: Overview
es: Resumen

source: Communication
es: Preguntas y Anuncios

source: Statement
es: Enunciado

source: Submissions
es: Enviar solución

source: Documentation
es: Documentación

source: Testing
es: Pruebas

source: Printing
es: Imprimir

source: is released under the
es: está publicado bajo

source: Announcements
es: Anuncios

source: (no subject)
es: (sin asunto)

source: Questions
es: Preguntas

source: Subject
es: Asunto

source: Text
es: Texto

source: Ask question
es: Preguntar

source: no answer yet
es: sin respuesta aún

source: Messages
es: Mensajes

source: Programming languages and libraries
es: Lenguajes de programación y bibliotecas

source: Submission details for compilation
es: Detalles de la compilación del envío

source: Message
es: Mensaje

source: Explanation
es: Explicación

source: Submission details for evaluation
es: Detalles de la evaluación del envío

source: An error occured while the server was handling your request.
es: Ocurrió un error mientras el servidor estaba ṕrocsando tu pedido.

source: Note that attempts to tamper with Contest Management System (such as probing the server with customized URLs) may be considered cheating and may lead to disqualification.
es: Tenga en cuenta que intentos de alterar el sistema (como sondear el servidor con URLs personalizadas) pude ser considerado hacer trampa y puede llevar a descalificación.

source: If you encountered this error during normal usage, please notify the contest administrators.
es: Si encontraste este error durante el uso normal, por favor avisele a los administradores de la competencia.

source: General information
es: Información general

source: The contest hasn't started yet.
es: La competencia no empezó todavía.

source: The contest will start at %(start_time)s and will end at %(stop_time)s.
es: La competencia empezará a las %(start_time)s y terminará a las %(stop_time)s.

source: The contest is currently running.
es: La competencia está en curso.

source: The contest started at %(start_time)s and will end at %(stop_time)s.
es: La competencia comenzó a las %(start_time)s y terminará a las %(stop_time)s.

source: The contest has already ended.
es: La competencia ya ha terminado

source: The contest started at %(start_time)s and ended at %(stop_time)s.
es: La competencia comenzó a las %(start_time)s y terminó a las %(stop_time)s.

source: You have an infinite number of tokens.
es: Tienes un número infinito de tokens.

source: You can see the detailed result of a submission by using a token on it.
es: Puedes ver el resultado detallado de tu envío usando un token en él.

source: Your score for each task will be the maximum among the tokened submissions and the last one.
es: El puntaje por cada problema será el máximo entre los envíos con token y el último.

source: You have a distinct set of tokens for each task.
es: Tienes distintos tokens para cada problema.

source: You can find the rules for the %(type_pl)s on each task's description page.
es: Puedes encontrar las reglas para los %(type_pl)s en cada descripción del problema.

source: You have a set of tokens shared among all tasks.
es: Los tokens son compartidos entre todos los problemas.

source: You have two types of tokens: a set of <em>contest-tokens</em> shared among all tasks and a distinct set of <em>task-tokens</em> for each task.
es: Tienes dos tipos de tokens: los compartidos entre todos los problemas y los específicos para cada problema.

source: You can see the detailed result of a submission by using two tokens on it, one of each type.
es: Puedes ver el resultado detallado de un envío usando dos tokens en él, uno de cada tipo

source: You can submit at most %(submissions)s solutions during this contest.
es: Puedes enviar a lo sumo %(submissions)s soluciones durante esta competencia.

source: You can submit at most %(user_tests)s user tests during this contest.
es: Puedes enviar a lo sumo %(user_tests)s tests durante esta competencia.

source: Every user is allowed to compete (i.e. submit solutions) for a uninterrupted time frame of %(per_user_time)s.
es: Todos los usuarios pueden competir (enviar soluciones) por un intervalo ininterrumpido de tiempo de %(per_user_time)s.

source: As soon as the contest starts you can choose to start your time frame.
es: Tan pronto como la competencia comience podrás elegir tu intervalo de tiempo.

source: Once you start, you can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
es: Una vez que empiezas, puedes enviar soluciones hasta el fin del intervalo de tiempo o hasta el fin de la competencia, lo que ocurra primero.

source: By clicking on the button below you can start your time frame.
es: Apretando el botón de abajo puds empezar tu intervalo de tiempo.

source: You started your time frame at %(start_time)s.
es: Comenzaste tu intervalo de tiempo a las %(start_time)s.

source: You can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
es: Puedes enviar soluciones hasta el fin del intervalo de tiempo o hasta el fin de la competencia, lo que ocurra primero.

source: You started your time frame at %(start_time)s and you already finished it.
es: Comenzaste tu intervalo de tiempo a las %(start_time)s y ya lo has terminado.

source: There's nothing you can do now.
es: No hay nada que puedas hacer ahora.

source: You never started your time frame. Now it's too late.
es: Nunca comenzaste tu intervalo de tiempo Ahora es demasiado tarde.

source: Start!
es: Empezar!

source: Task overview
es: Resumen de los problemas

source: Task
es: Problema

source: Name
es: Nombre

source: Time limit
es: Límite de tiempo

source: Memory limit
es: Límite de memoria

source: %(seconds)g second
es: %(seconds)g segundo

source: %(seconds)g seconds
es: %(seconds)g segundos

source: Yes
es: Sí

source: Print
es: Imprimir

source: Submit
es: Enviar

source: Previous print jobs
es: Pedidos de impresión anteriores

source: Date and time
es: Fecha y hora

source: Time
es: Tiempo

source: Status
es: Estado

source: no print jobs yet
es: no pedidos de impresión por ahora

source: Preparing...
es: Preparando...

source: Compilation output
es: Salida de la compilación

source: Compilation outcome:
es: Resultado de la compilación:

source: Compilation time:
es: Tiempo de compilación:

source: Memory used:
es: Memoria usada:

source: Standard output
es: Salida estandar

source: Standard error
es: Error estandar

source: None
es: Ninguno

source: Download
es: Descargar

source: Played
es: Usado

source: Play!
es: Usar

source: Wait...
es: Esperar...

source: No tokens
es: Sin tokens

source: %(name)s (%(short_name)s) <small>description</small>
es: %(name)s (%(short_name)s) <small>descripción</small>

source: no statement available
es: no hay ningún enunciado disponible

source: Download task statement
es: Descargar enunciado

source: The statement for this task is available in multiple versions, in different languages.
es: El enunciado para este problema está disponible en múltiples versiones, en diferentes lenguajes.

source: You can see (and download) all of them using the list on the right.
es: Puedes ver (y descargar) todos ellos usando la lista a la derecha.

source: Some suggested translations follow.
es: Algunas traducciones se presentan a continuación.

source: Statement in <b>%s</b>
es: Enunciado en <b>%s</b>

source: Statement in %s
es: Enunciado en %s

source: Some details
es: Algunos detalles

source: Compilation commands
es: Comandos de compilación

source: You can find the rules for the %(type_pl)s on the <a href="%(url_root)s/">contest overview page</a>.
es: Puedes encontrar las reglas para los %(type_pl)s en el <a href="%(url_root)s/">resumen de la competencia</a>.

source: Remeber that to see the detailed result of a submission you need to use both a contest-token and a task-token.
es: Recuerda que para ver la descripción detallada de un envío necesitas usar un token-competencia y un token-problema.

source: Attachments
es: Archivos adjuntos

source: %(name)s (%(short_name)s) <small>submissions</small>
es: %(name)s (%(short_name)s) <small>envíos</small>

source: Submit a solution
es: Enviar una solución

source: You can submit %(submissions_left)s more solution(s).
es: Puedes enviar %(submissions_left)s más solucione(s).

source: submission.zip
es: envio.zip

source: Previous submissions
es: Envíos anteriores

source: Right now, you have infinite tokens available on this task.
es: En este momento tienes infinitos tokens disponibles para este problema.

source: Right now, you have one token available on this task.
es: En este momento tienes un token disponible para este problema.

source: Right now, you have %(tokens)s tokens available on this task.
es: En este momento tienes %(tokens)s tokens disponibles para este problema.

source: But you have to wait until %(expiration_time)s to use them.
es: Pero debes esperar hasta %(expiration_time)s para usarlos.

source: You will receive a new token at %(gen_time)s.
es: Recibirás un nuevo token a las %(gen_time)s.

source: In the current situation, no more tokens will be generated.
es: En la situación actual, no se generarán más tokens.

source: Right now, you do not have tokens available for this task.
es: En este momento, no tienes tokens disponibles para este problema.

source: But you will have to wait until %(expiration_time)s to use it.
es: Pero deberás esperar hasta %(expiration_time)s para usarlos.

source: Public score
es: Puntaje

source: Total score
es: Puntaje total

source: Score
es: Puntaje

source: Files
es: Archivos

source: no submissions yet
es: no hay envíos hasta ahora

source: Submission details
es: Detalles del envío

source: Close
es: Cerrar

source: Submit a test
es: Enviar una prueba

source: You can submit %(user_tests_left)s more test(s).
es: Puedes enviar %(user_tests_left)s más envío(s).)

source: input
es: entrada

source: Previous tests
es: Pruebas anteriores

source: Input
es: Entrada

source: Output
es: Salida

source: no tests yet
es: no hay pruebas hasta ahora

source: Test details
es: Detalles de la prueba

source: Evaluation outcome
es: Resultados de la prueba
